{
  "title": "love actually 2020",
  "body": "(by aduke king!)\n\n\n\nBefore straining some tedious metaphor or poking fun at dated depictions of fictional lives I’d actually much rather lead, I must say how incredibly honoured I am to part of this wonderful event. Without a clear vision, an understanding of what people both want and need as well as a full grasp of the importance of this seminal work, we would not be here. All of this and so much more is down to a decade long effort by our esteemed festive leader. After tonight we will be different people - Christmas ready people, filled with a lust for life that you would not expect has actually happened every year for the past ten. This love and dedication is clear for us all to see and we truly appreciate it. From us all, Eilis, thank you.\n\nNow, nothing speaks to the excitement and anticipation of Christmas like juggling a packed diary to fit in a Love Actually online stream and chat - not even juggling lies to family members to avoid becoming anyone’s second or third ‘household’ on Christmas Day. For this year, maybe more than most, we might all really need to be swept up in a 2 hour heady mix of pop bangers, mild politics and utterly unconvincing plot.\n\nHere we are again, thinking about the rose tinted lonely live of an incongruous interconnected group of Londoners in the run up to Christmas. In real life, this year may have been an exceptionally lonely time for some and until now, trying to find something good may have felt like an ongoing fruitless pursuit but all hope is not lost.\n\nAs we come together virtually, we can take comfort in the reality of our collective spirit. Though there is little to add to the myriad musings on this weird year, there is forever a dearth of writing on the most unifying festive flick\\[!] We may all know the plot, all know the triggering scenes and endless problematic dialogue, but there is still so much to be said for what this film can do, especially in a time of crisis. Of course it is the nature of character arcs to find resolution in the final act but ignoring this, Love Actually gives us hope in an uncertain time that things might actually work out. Though not all of the good and nice characters get good and nice things - like a marriage free from distrust or a passionate relationship with a colleague that’s been two years in the imagination or in fact any chance at love at all - but there is that scene at the airport at the end so there’s no need to dwell on the realer, shittier parts. And that’s what tonight is, a chance to come together, cast off the not so sweet parts of real life and sit separately together in some good old questionable, relatable nostalgia."
}